Actualización del formato del diagrama
